-- phpMyAdmin SQL Dump
-- version 5.0.3
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Nov 17, 2020 at 10:45 AM
-- Server version: 10.4.14-MariaDB
-- PHP Version: 7.4.11

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `currency_basic`
--

-- --------------------------------------------------------

--
-- Table structure for table `currency`
--

CREATE TABLE `currency` (
  `id` int(11) NOT NULL,
  `numCode` char(11) NOT NULL,
  `charCode` char(10) NOT NULL,
  `name` varchar(50) NOT NULL,
  `value` int(11) NOT NULL,
  `date` datetime NOT NULL,
  `created` datetime DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `currency`
--

INSERT INTO `currency` (`id`, `numCode`, `charCode`, `name`, `value`, `date`, `created`) VALUES
(1, '036', 'AUD', 'Австралийский доллар', 559764, '2020-11-14 00:00:00', '2020-11-15 20:58:07'),
(2, '944', 'AZN', 'Азербайджанский манат', 455128, '2020-11-14 00:00:00', '2020-11-15 20:58:07'),
(3, '826', 'GBP', 'Фунт стерлингов Соединенного королевства', 1017535, '2020-11-14 00:00:00', '2020-11-15 20:58:07'),
(4, '051', 'AMD', 'Армянских драмов', 156215, '2020-11-14 00:00:00', '2020-11-15 20:58:08'),
(5, '933', 'BYN', 'Белорусский рубль', 301208, '2020-11-14 00:00:00', '2020-11-15 20:58:08'),
(6, '975', 'BGN', 'Болгарский лев', 467002, '2020-11-14 00:00:00', '2020-11-15 20:58:08'),
(7, '986', 'BRL', 'Бразильский реал', 141675, '2020-11-14 00:00:00', '2020-11-15 20:58:08'),
(8, '348', 'HUF', 'Венгерских форинтов', 257282, '2020-11-14 00:00:00', '2020-11-15 20:58:08'),
(9, '344', 'HKD', 'Гонконгских долларов', 997281, '2020-11-14 00:00:00', '2020-11-15 20:58:08'),
(10, '208', 'DKK', 'Датская крона', 122670, '2020-11-14 00:00:00', '2020-11-15 20:58:08'),
(11, '840', 'USD', 'Доллар США', 773262, '2020-11-14 00:00:00', '2020-11-15 20:58:08'),
(12, '978', 'EUR', 'Евро', 913222, '2020-11-14 00:00:00', '2020-11-15 20:58:08'),
(13, '356', 'INR', 'Индийских рупий', 103708, '2020-11-14 00:00:00', '2020-11-15 20:58:08'),
(14, '398', 'KZT', 'Казахстанских тенге', 179749, '2020-11-14 00:00:00', '2020-11-15 20:58:08'),
(15, '124', 'CAD', 'Канадский доллар', 588345, '2020-11-14 00:00:00', '2020-11-15 20:58:08'),
(16, '417', 'KGS', 'Киргизских сомов', 918636, '2020-11-14 00:00:00', '2020-11-15 20:58:08'),
(17, '156', 'CNY', 'Китайский юань', 116893, '2020-11-14 00:00:00', '2020-11-15 20:58:08'),
(18, '498', 'MDL', 'Молдавских леев', 451672, '2020-11-14 00:00:00', '2020-11-15 20:58:08'),
(19, '578', 'NOK', 'Норвежских крон', 843574, '2020-11-14 00:00:00', '2020-11-15 20:58:08'),
(20, '985', 'PLN', 'Польский злотый', 203063, '2020-11-14 00:00:00', '2020-11-15 20:58:08'),
(21, '946', 'RON', 'Румынский лей', 187617, '2020-11-14 00:00:00', '2020-11-15 20:58:08'),
(22, '960', 'XDR', 'СДР (специальные права заимствования)', 1097328, '2020-11-14 00:00:00', '2020-11-15 20:58:08'),
(23, '702', 'SGD', 'Сингапурский доллар', 573211, '2020-11-14 00:00:00', '2020-11-15 20:58:08'),
(24, '972', 'TJS', 'Таджикских сомони', 682641, '2020-11-14 00:00:00', '2020-11-15 20:58:08'),
(25, '949', 'TRY', 'Турецкая лира', 100786, '2020-11-14 00:00:00', '2020-11-15 20:58:09'),
(26, '934', 'TMT', 'Новый туркменский манат', 221248, '2020-11-14 00:00:00', '2020-11-15 20:58:09'),
(27, '860', 'UZS', 'Узбекских сумов', 746320, '2020-11-14 00:00:00', '2020-11-15 20:58:09'),
(28, '980', 'UAH', 'Украинских гривен', 275011, '2020-11-14 00:00:00', '2020-11-15 20:58:09'),
(29, '203', 'CZK', 'Чешских крон', 344330, '2020-11-14 00:00:00', '2020-11-15 20:58:09'),
(30, '752', 'SEK', 'Шведских крон', 894255, '2020-11-14 00:00:00', '2020-11-15 20:58:09'),
(31, '756', 'CHF', 'Швейцарский франк', 845003, '2020-11-14 00:00:00', '2020-11-15 20:58:09'),
(32, '710', 'ZAR', 'Южноафриканских рэндов', 494989, '2020-11-14 00:00:00', '2020-11-15 20:58:09'),
(33, '410', 'KRW', 'Вон Республики Корея', 694742, '2020-11-14 00:00:00', '2020-11-15 20:58:09'),
(34, '392', 'JPY', 'Японских иен', 735774, '2020-11-14 00:00:00', '2020-11-15 20:58:09'),
(35, '036', 'AUD', 'Австралийский доллар', 559764, '2020-11-14 00:00:00', '2020-11-15 20:59:09'),
(36, '944', 'AZN', 'Азербайджанский манат', 455128, '2020-11-14 00:00:00', '2020-11-15 20:59:09'),
(37, '826', 'GBP', 'Фунт стерлингов Соединенного королевства', 1017535, '2020-11-14 00:00:00', '2020-11-15 20:59:09'),
(38, '051', 'AMD', 'Армянских драмов', 156215, '2020-11-14 00:00:00', '2020-11-15 20:59:09'),
(39, '933', 'BYN', 'Белорусский рубль', 301208, '2020-11-14 00:00:00', '2020-11-15 20:59:09'),
(40, '975', 'BGN', 'Болгарский лев', 467002, '2020-11-14 00:00:00', '2020-11-15 20:59:09'),
(41, '986', 'BRL', 'Бразильский реал', 141675, '2020-11-14 00:00:00', '2020-11-15 20:59:09'),
(42, '348', 'HUF', 'Венгерских форинтов', 257282, '2020-11-14 00:00:00', '2020-11-15 20:59:09'),
(43, '344', 'HKD', 'Гонконгских долларов', 997281, '2020-11-14 00:00:00', '2020-11-15 20:59:09'),
(44, '208', 'DKK', 'Датская крона', 122670, '2020-11-14 00:00:00', '2020-11-15 20:59:09'),
(45, '840', 'USD', 'Доллар США', 773262, '2020-11-14 00:00:00', '2020-11-15 20:59:09'),
(46, '978', 'EUR', 'Евро', 913222, '2020-11-14 00:00:00', '2020-11-15 20:59:09'),
(47, '356', 'INR', 'Индийских рупий', 103708, '2020-11-14 00:00:00', '2020-11-15 20:59:09'),
(48, '398', 'KZT', 'Казахстанских тенге', 179749, '2020-11-14 00:00:00', '2020-11-15 20:59:09'),
(49, '124', 'CAD', 'Канадский доллар', 588345, '2020-11-14 00:00:00', '2020-11-15 20:59:09'),
(50, '417', 'KGS', 'Киргизских сомов', 918636, '2020-11-14 00:00:00', '2020-11-15 20:59:09'),
(51, '156', 'CNY', 'Китайский юань', 116893, '2020-11-14 00:00:00', '2020-11-15 20:59:09'),
(52, '498', 'MDL', 'Молдавских леев', 451672, '2020-11-14 00:00:00', '2020-11-15 20:59:09'),
(53, '578', 'NOK', 'Норвежских крон', 843574, '2020-11-14 00:00:00', '2020-11-15 20:59:09'),
(54, '985', 'PLN', 'Польский злотый', 203063, '2020-11-14 00:00:00', '2020-11-15 20:59:09'),
(55, '946', 'RON', 'Румынский лей', 187617, '2020-11-14 00:00:00', '2020-11-15 20:59:09'),
(56, '960', 'XDR', 'СДР (специальные права заимствования)', 1097328, '2020-11-14 00:00:00', '2020-11-15 20:59:09'),
(57, '702', 'SGD', 'Сингапурский доллар', 573211, '2020-11-14 00:00:00', '2020-11-15 20:59:09'),
(58, '972', 'TJS', 'Таджикских сомони', 682641, '2020-11-14 00:00:00', '2020-11-15 20:59:09'),
(59, '949', 'TRY', 'Турецкая лира', 100786, '2020-11-14 00:00:00', '2020-11-15 20:59:09'),
(60, '934', 'TMT', 'Новый туркменский манат', 221248, '2020-11-14 00:00:00', '2020-11-15 20:59:09'),
(61, '860', 'UZS', 'Узбекских сумов', 746320, '2020-11-14 00:00:00', '2020-11-15 20:59:10'),
(62, '980', 'UAH', 'Украинских гривен', 275011, '2020-11-14 00:00:00', '2020-11-15 20:59:10'),
(63, '203', 'CZK', 'Чешских крон', 344330, '2020-11-14 00:00:00', '2020-11-15 20:59:10'),
(64, '752', 'SEK', 'Шведских крон', 894255, '2020-11-14 00:00:00', '2020-11-15 20:59:10'),
(65, '756', 'CHF', 'Швейцарский франк', 845003, '2020-11-14 00:00:00', '2020-11-15 20:59:10'),
(66, '710', 'ZAR', 'Южноафриканских рэндов', 494989, '2020-11-14 00:00:00', '2020-11-15 20:59:10'),
(67, '410', 'KRW', 'Вон Республики Корея', 694742, '2020-11-14 00:00:00', '2020-11-15 20:59:10'),
(68, '392', 'JPY', 'Японских иен', 735774, '2020-11-14 00:00:00', '2020-11-15 20:59:10');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `currency`
--
ALTER TABLE `currency`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `currency`
--
ALTER TABLE `currency`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=69;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
